{ "metadata": [ { "description": "Overview It all comes together here! Individually, the Silver Surfer, Super-Skrull, Ronan and Nova have faced down the Annihilation Wave... and lost! Now, they must unite those who remain or die by Annihilus’ hand! The Annihilation has only begun!---Annihilation Day has come and gone. The Kyln has been compromised, Xandar is lost, the Annihilation Wave is busily destroying everything in its path in service to Annihilus.&#34;Last Stand&#34; really doesn&#39;t mean much when your team is a relatively small band of warriors with little allegiance other than to their own survival. Be that as it may, Richard Rider, the last remaining Nova Corps member, imbued with the entire Nova Force is commander-in-cheif of this small band of survivors. At his side, Peter Quill (Starlord), Gamora, Ronan the Accuser and a relatively small force of Kree warriors. Drax the Destroyer, acting as a one man army, is also nearby seemingly keeping Cammi out of harms way. In space, holding off the orbital attack, are three ex-heralds of Galactus: Firelord, Red Shift and Stardust.They fight the good fight, against an impossibly powerful enemy. Richard is pushed to his limit, having to make the tough decisions, sacrifice decisions -- it is a good thing Drax was able to mold a man out of him in time for this battle.Firelord makes his own sacrifice, which leads to a significant battle strategy: take out the Queen (Extirpia), her attack force falls to disarray.Needless to say, Annihilus did not take this loss lightly. He and Thanos briefly discuss strategy as patience runs thin (on both sides). Annihilus decides that extermination of the ex-heralds is the new priority.No real rest for Nova and team (who have become known as the United Front), as Richard and Peter check in on the Firelord and Extorpia. During the interrogation, they discover that Glactus and his favored herald, Silver Surfer have fallen -- at the hands of Aegis and Tenebrous with a little coordination by Thanos and his parrot, Skreet.", "name": "Annihilation", "year": "2006", "publisher": "Marvel", "type": "comicSeries" } ] }
